//
//  HardKoreanWords.swift
//  WordQuizDaily
//
//  Created by 정종원 on 1/25/24.
//


import Foundation

struct HardKoreanWords {
    //명사, 대명사, 의존명사 사용
    let hardWords = [
        // ㄱ
        "가닥", "가상", "가설", "각광", "각오", "갈등", "갈피", "개발", "거리낌", "걸림돌",
        "겨를", "격려", "견문", "견본", "결손", "결의", "결핍", "결함", "경쟁", "경향",
        "계기", "고정관념", "고집", "고찰", "고충", "곤경", "공로", "공익", "공존", "과찬",
        "관념", "관용", "관행", "궁핍", "귀감", "균형", "기량", "기반", "기세", "기우",
        "기질", "기치", "기틀", "기품", "까닭", "꼬투리", "낌새", "나위", "남녀노소", "낭패",
        // ㄴ
        "노후", "논거", "논란", "논쟁", "논점", "뇌물", "능률",
        // ㄷ
        "단결", "단서", "당부", "당시", "대상", "덜미", "돌파구", "동작", "동조",
        // ㅁ
        "마감", "마구잡이", "마찰", "막무가내", "막판", "만료", "말꼬리", "말문", "망정", "매듭",
        "마무리", "매연", "매출", "맥락", "면모", "멸종", "명목", "명복", "명색", "명성",
        "명칭", "모범", "모순", "몫", "묘미", "묵념", "문명", "문물", "문턱", "물질",
        "미궁", "미끼", "미덕", "민원", "밑거름", "밑바탕",
        // ㅂ
        "반란", "반발", "반열", "반입", "발상", "방사능", "방안", "방어", "방침", "방패",
        "배려", "번영", "변동", "변천", "별개", "별도", "보람", "보상", "본능", "본보기",
        "부문", "분노", "분야", "분쟁", "비결", "비만", "비법", "비율", "비중", "빈도",
        // ㅅ
        "사례", "사시사철", "사태", "살림", "상생", "상식", "새싹", "생계", "생존", "생성",
        "선의", "선착순", "성과", "성능", "성분", "성비", "성원", "성품", "성향", "세균",
        // ㅇ
        "악순환", "악의", "안건", "안도", "안목", "안보", "안식", "안정", "압박", "액수",
        "야망", "약속", "양극화", "양보", "양심", "어긋남", "어려움", "어휘", "언론", "엄격",
        "업적", "업체", "여건", "여유", "연구", "연대", "연령", "연속", "연출", "열정",
        "염두", "영감", "영향", "예고", "예방", "예산", "예측", "오류", "오만", "오해",
        "온갖", "온도", "완벽", "완성", "완화", "왕복", "요구", "요약", "요인", "용기",
        "용량", "우려", "우선", "우정", "운동", "운명", "운영", "운행", "원칙", "위기",
        "위로", "위반", "위성", "위험", "유능", "유래", "유리", "유익", "유지", "유행",
        "은밀", "의견", "의도", "의문", "의사", "의식", "의지", "이념", "이론", "이익",
        "인간", "인기", "인내", "인도", "인물", "인상", "인식", "인연", "인용", "인재",
        "일반", "일부", "일상", "일시", "일정", "임금", "임시", "임원", "입장", "입학",
        // ㅈ
        "자격", "자기", "자립", "자부심", "자신", "자연", "자원", "자유", "자율", "작가",
        "작용", "잔고", "잔액", "잠재", "잠정", "장관", "장기", "장비", "장소", "장애",
        "장점", "재능", "재력", "재산", "재생", "재앙", "재정", "재직", "재활", "저가",
        "저널", "저축", "적극", "적립", "적응", "전과", "전달", "전략", "전망", "전문",
        "전시", "전원", "전쟁", "전자", "전통", "전환", "절대", "절망", "절차", "절충",
        "점검", "점수", "점진", "접근", "정기", "정당", "정도", "정리", "정말", "정서",
        "정신", "정의", "정작", "정점", "정치", "제거", "제공", "제도", "제시", "제안",
        "제약", "제외", "제재", "제조", "제출", "제한", "조각", "조건", "조명", "조사",
        "조성", "조언", "조직", "조정", "조치", "존경", "존재", "종교", "종류", "종목",
        "종이", "종합", "좌절", "주가", "주관", "주기", "주년", "주목", "주문", "주변",
        "주식", "주요", "주의", "주장", "주제", "주택", "주행", "준비", "줄거리", "중간",
        "중단", "중립", "중요", "중재", "중점", "중화", "즉석", "즉시", "증거", "증권",
        "증대", "증명", "지각", "지구", "지능", "지도", "지름길", "지배", "지불", "지식",
        "지옥", "지역", "지원", "지위", "지정", "지점", "지지", "지침", "지표", "직감",
        "직관", "직급", "직무", "직업", "직원", "직장", "직접", "직책", "진단", "진동",
        "진로", "진리", "진실", "진정", "진지", "진행", "질문", "질서", "질적", "짐작",
        "집단", "집안", "집중", "징계",
        //ㅊ
        "차별", "차이", "착각", "착수", "착용", "찬성",
        "참고", "참석", "참여", "참조", "창고", "창작", "창조", "창출", "채권", "채무",
        "채널", "책임", "처벌", "처리", "처방", "처음", "처치", "천국", "천재", "철도",
        "철학", "청구", "청렴", "청소년", "청소부", "청춘", "체계", "체념", "체력", "체면",
        "체온", "체육", "체중", "체험", "초과", "초기", "초대", "초록", "초보", "초점",
        "초청", "최고", "최대", "최소", "최선", "최신", "최초", "추가", "추격", "추론",
        "추리", "추억", "추적", "추천", "추측", "출근", "출구", "출발", "출산", "출석",
        "출신", "출연", "출판", "출현", "충고", "충돌", "충분", "충성", "취업", "취재",
        "취지", "측면", "치료", "치안", "치열", "친구", "친밀", "친절", "친화", "침묵",
        "침해", "칭찬",
        // ㅋ
        "칼럼", "캠퍼스", "캐릭터", "커리어", "커플", "커피", "컨셉", "컬러", "컬렉션", "컴퓨터",
        "코드", "코멘트", "코미디", "코스", "코치", "콘서트", "콘텐츠", "콜센터", "콤플렉스", "쿠폰",
        // ㅌ
        "타격", "타당", "타이틀", "탁월", "탄력", "탄생", "탈락", "탈출", "탑재", "태도",
        "태양", "태풍", "택배", "터널", "테러", "테마", "테스트", "테크닉", "텍스트", "텔레비전",
        "토론", "토양", "토지", "톤업", "톱클래스", "통계", "통과", "통로", "통보", "통신",
        "통역", "통제", "통찰", "통합", "통행", "퇴근", "퇴임", "퇴장", "퇴직", "퇴출",
        "특기", "특성", "특징", "팀워크", "파괴", "파급", "파악", "파업", "파일", "파이널",
        "파티", "판결", "판단", "판례", "판사", "판촉", "팔로우", "패널", "패키지", "패턴",
        "팩트", "페이스북", "페이퍼", "페이팔", "페인트", "펜션", "펜타곤", "펠로우", "편견", "편지",
        "평가", "평균", "평등", "평론", "평화", "폐기", "폐쇄", "포기", "포맷", "포부",
        "포장", "포지션", "포인트", "포착", "포털", "포커스", "포털사이트", "포트폴리오", "폭력", "폭발",
        "폭우", "폭염", "폭주",
        //ㅎ
        "하락", "하마", "하망", "하숙", "하양", "하자", "하체", "하천", "하층", "하품",
        "학계", "학년", "학력", "학문", "학부", "학사", "학습", "학위", "학자", "학점",
        "한계", "한기", "한눈", "한때", "한문", "한발", "한숨", "한자", "한정", "한편",
        "한해", "할인", "함량", "합격", "합동", "합류", "합리", "합의", "항공", "항구",
        "항목", "항의", "항해", "해답", "해당", "해독", "해석", "해소", "해안", "해외",
        "해제", "해직", "해체", "해충", "해파리", "해학", "행동", "행사", "행위", "행정",
        "향기", "향상", "허가", "허공", "허리", "허위", "허용", "허전", "허파", "험담",
        "현관", "현금", "현기", "현대", "현물", "현상", "현실", "현장", "현존", "현지",
        "현찰", "현황", "혈액", "협동", "협력", "협상", "협의", "형국", "형님", "형사",
        "형식", "형태", "혜택", "호감", "호남", "호랑이", "호르몬", "호흡", "혼돈", "혼동",
        "혼란", "혼례", "혼합", "홍보", "홍수", "화가", "화면", "화분", "화재", "화제",
        "화학", "확대", "확립", "확보", "확산", "확신", "확인", "확장", "확정", "환경",
        "환기", "환상", "환영", "환율", "환자", "활기", "활동", "활력", "활발", "활성",
        "활약", "활용", "활자", "활주", "회견", "회계", "회고", "회담", "회로", "회복",
        "회비", "회색", "회사", "회수", "회식", "회신", "회심", "회장", "회전", "회중",
        "회진", "회화", "획득", "획일", "획정", "획책", "획득", "횡단", "효과", "효력",
        "효율", "효자", "효장", "후기", "후방", "후배", "후보", "후속", "후유증", "후회",
        "훈련", "훈민", "훈장", "훌륭", "훼손", "휠체어", "휴가", "휴게", "휴대", "휴식",
        "휴양", "휴일", "휴지", "흉내", "흐름", "흑백", "흑자", "흔적", "흔치", "흠집",
        "흥분", "흥행", "희곡", "희망", "희생", "희소", "희열", "희망"
    ]
}
